wintersmith/contents/articles/Java/2013-07-06-mac-oxs-eclipse-maven-install.html
---
date: 2013-07-06
template: tech.jade
title: Mac osx 安装eclipse和maven
category: Java
change_frequency: monthly
tag: eclipse,maven
---

<p>
Eclipse 是一个IDE工具，用来进行Java开发，是java开发中旗舰级的IDE。Eclipse软件本身的设计就非常优秀和可扩展。在java的IDE中除了IBM的eclipse，还有Sun不久前推出的NetBean。
</p>
<p>
Maven 是一套构建工具，用来进行项目的打包。maven可以自动进行依赖的下载、打包出一个tgz的压缩包，供web容器加载。
</p>
<p>
eclipse + maven 是进行java web开发的基础工具搭配，用eclipse开发代码，maven完成打包。
</p>
<p>
本文介绍怎么在mac osx平台进行这个环境的安装和搭建。
</p>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">安装eclipse与maven</a>
<ul>
<li><a href="#sec-1-1">安装eclipse</a></li>
<li><a href="#sec-1-2">安装maven插件</a></li>
<li><a href="#sec-1-3">安装maven</a></li>
<li><a href="#sec-1-4">安装jdk</a></li>
<li><a href="#sec-1-5">配置eclipse集成maven</a></li>
</ul>
</li>
<li><a href="#sec-2">使用eclipse与maven</a>
<ul>
<li><a href="#sec-2-1">eclipse导入maven工程</a></li>
<li><a href="#sec-2-2">maven构建代码包</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-3">
<h3 id="sec-1">安装eclipse与maven</h3>
<div class="outline-text-3" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-4">
<h4 id="sec-1-1">安装eclipse</h4>
<div class="outline-text-4" id="text-1-1">

<p>eclipse的安装可以从其<a href="http://eclipse.org/">官网</a>下载。这里选择: Eclipse Standard 4.3，代号开普勒。
</p></div>

</div>

<div id="outline-container-1-2" class="outline-4">
<h4 id="sec-1-2">安装maven插件</h4>
<div class="outline-text-4" id="text-1-2">

<p>下载安装完成后，安装maven插件。
</p>
<p>
对于4.3这个版本（以及更新的），我们不需要去网站上下载这个插件，而只需要从eclipse自带的插件市场功能里面选择和下载即可：<br/>
从菜单中选择：Help-&gt;eclipse marketplace , 在出现的面板中输入m2eclipse查找这个插件，然后安装它就完成了。
</p></div>

</div>

<div id="outline-container-1-3" class="outline-4">
<h4 id="sec-1-3">安装maven</h4>
<div class="outline-text-4" id="text-1-3">

<p>使用macport进行安装maven：<br/>
在终端中输入 <code>sudo port install maven</code> <br/>
安装完成后maven的个人配置位于 <code>~/.m2</code> 我们将自己的settings.xml文件放置于此，maven就会优先使用个人配置。
</p></div>

</div>

<div id="outline-container-1-4" class="outline-4">
<h4 id="sec-1-4">安装jdk</h4>
<div class="outline-text-4" id="text-1-4">

<p>maven编译java代码需要使用jdk，如果没有需要通过macport进行安装:<br/>
<code>sudo port install jdk</code>
</p></div>

</div>

<div id="outline-container-1-5" class="outline-4">
<h4 id="sec-1-5">配置eclipse集成maven</h4>
<div class="outline-text-4" id="text-1-5">

<p>eclipse 与maven配合，需要配置eclipse的maven插件：m2eclipse让此插件指向安装的maven（也可以使用其内置的），更重要的是使用我们配置的maven配置(settings.xml)文件。
</p>
<p>
通过在菜单栏Eclipse-&gt;偏好设定-&gt;maven下面进行maven的配置:
</p><ul>
<li>installation: 配置插件使用的maven二进制体（默认是内置的mvn）
</li>
<li>User settings : 此处用于配置个人配置的路径（要使用的settings.xml文件的位置)和maven管理的local repo的位置（一般在settings.xml设定，要与此处一致）。
</li>
</ul>


<p>
在User settings 这里，repo旁边有一个reindex的按钮，点击它进行更新本地repo。这会下载settings.xml里面配置的repo到本地。
</p>
<p>
配置完成后eclipse的 <code>CLASS_LIB</code> 中包含了maven的local repo的地址。
</p>
</div>
</div>

</div>

<div id="outline-container-2" class="outline-3">
<h3 id="sec-2">使用eclipse与maven</h3>
<div class="outline-text-3" id="text-2">


</div>

<div id="outline-container-2-1" class="outline-4">
<h4 id="sec-2-1">eclipse导入maven工程</h4>
<div class="outline-text-4" id="text-2-1">

<p>安装了maven插件后，可以在菜单：File-&gt;import-&gt;maven-&gt;Existing maven projects 来将maven工程导入eclipse进行开发。
</p>
</div>

</div>

<div id="outline-container-2-2" class="outline-4">
<h4 id="sec-2-2">maven构建代码包</h4>
<div class="outline-text-4" id="text-2-2">

<p>当开发完成后，使用maven进行打包：
</p>


<pre class="example">mvn install
</pre>

<p>
如果要跳过test：
</p>


<pre class="example">mvn -Dmaven.test.skip=true install
</pre>

<p>
生成的包位于target目录，如: <code>t4web.tgz</code>
</p></div>
</div>
</div>
